## №1 **Удаление дубликатов**  
Напишите функцию `remove_duplicates(lst)`, которая принимает список и возвращает множество, удаляя все дубликаты.

~~~python
lst = [1, 2, 2, 3, 4, 5, 5]  
def remove_duplicates(lst):  
    lst_set = set(lst)  
    print(lst_set)  
remove_duplicates(lst)
~~~

## №2 **Пересечение множеств**  
Даны два множества:

python

КопироватьРедактировать

`set1 = {1, 2, 3, 4, 5}   set2 = {4, 5, 6, 7, 8}`

Найдите их пересечение.

~~~python
set1 = {1, 2, 3, 4, 5}  
set2 = {4, 5, 6, 7, 8}  
print(set1 & set2)
~~~

## №3 **Разность множеств**  
Используя те же множества `set1` и `set2`, найдите их разность.

~~~python
set1 = {1, 2, 3, 4, 5}  
set2 = {4, 5, 6, 7, 8}  
print(set1 - set2)
~~~

## №4 **Определение уникальных символов**  
Напишите программу, которая принимает строку и выводит все уникальные символы в ней.

~~~python
a = input()  
b = set(a)  
print(b)
~~~

## №5 **Проверка вхождения**  
Напишите функцию, которая проверяет, является ли одно множество подмножеством другого.

~~~python
set1 = {1, 2, 3} 
set2 = {4, 5, 6} 
if set1.issubset(set2): # или if set1 <= set2 print("Да") 
else: print("Нет")
~~~

## №6 **Создание словаря из списка**  
Дана строка с именами:

python

КопироватьРедактировать

`names = ["Alice", "Bob", "Charlie", "Alice", "Bob", "Alice"]`

~~~python
names = ["Alice", "Bob", "Charlie", "Alice", "Bob", "Alice"]

name_counts = {}  # Создаём пустой словарь

for name in names:
    if name in name_counts:
        name_counts[name] += 1  # Увеличиваем счётчик, если имя уже есть
    else:
        name_counts[name] = 1  # Добавляем имя, если его нет

print(name_counts)
~~~

## №7  Напишите функцию, которая принимает словарь и возвращает новый словарь, где ключи и значения поменяны местами.

[[Лекция 8. Задачи]]