## 1. Вводится N строк. Нужно определить, сколько среди этих строк фраз, где упоминается ВШЭ (буквы HSE)

~~~python
b = 0  
N = int(input())  
for i in range(N):  
    a = input().upper()  
    b += a.count("HSE")  
print(b)
~~~


## 2. Ассистент Маргариты Борисовны собирает оценки студентов

ФОРМАТ ВВОДА

Программа получает на вход число студентов в группе. Далее идет N строк, в каждой строке записан результат в виде "оценка 5"

ФОРМАТ ВЫВОДА

Вещественное число — средняя оценка всех участников."

~~~python
count = 0  
result = 0  
chislo = int(input())  
for i in range(chislo):  
    ocenka = input()  
    result += int(ocenka.split()[1])  
    count += 1  
print(result/count) 
# 4
# оценка 2
# оценка 5
# оценка 1
# оценка 3
# >> 2,75
~~~
## 3. Дается строка, где записано имя и фамилия студента. Зачесть, если студента зовут Мария. Имя может быть написано в любом регистре.

ФОРМАТ ВВОДА

Строка

ФОРМАТ ВЫВОДА

Строка ""Это Мария!"" или ""Это точно не Мария"""

~~~python
fi = input().upper()  
  
if "МАРИЯ" in fi:  
    print("Это Мария!")  
else:  
    print("Это точно не Мария")
~~~

[[Лекция 7. Задачи]]